CASE/aachenBomb/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sprayFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.01;

deltaT          2.5e-06;

writeControl    adjustableRunTime;

writeInterval   5e-05;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep  yes;

maxCo           0.1;

runTimeModifiable yes;

functions
{
    #includeFunc Qdot

    cloudInfo1
    {
        libs            ("liblagrangianCloudInfoFunctionObjects.so");
        type            basicSprayCloudInfo;//basicReactingMultiphaseCloudInfo;
        //basicReactingMultiphaseCloudInfo;//for reactingParcelFoam and coalChemistryFoam
        //basicSprayCloudInfo;//for sprayFoam
        //basicKinematicMPPICCloudInfo;//
        //basicThermoCloudInfo;// for I dont know which Foam, you can see the name in createClouds.H
        //basicKinematicCloudInfo;//
        //basicKinematicCollidingCloudInfo;//
        //basicReactingCloudInfo;//

        enabled         true;
        writeControl    timeStep;
        writeInterval   1;

        penetration     0.95;    // fraction of the total mass, in [0, 1]
        position        (0 0.0995 0); // initial position
        direction       (0 -1 0); // initial spray direction
        clouds          (sprayCloud);//(reactingCloud1); // cloud name, i.e., the folder name in 0/lagrangian
    }

}


// ************************************************************************* //
